[
  {"id":1,"text":"Hippos’ poop is spun in circles to mark territory."},
  {"id":2,"text":"Termites produce more methane than cows due to their poop."},
  {"id":3,"text":"Koalas usually poop multiple times a day despite low-nutrient diet."},
  {"id":4,"text":"Beavers use poop piles to mark territory and attract mates."},
  {"id":5,"text":"Poop coffee (Kopi Luwak) is made from beans eaten and excreted by civets."},
  {"id":6,"text":"Flamingos use their own poop to build nest passages."},
  {"id":7,"text":"In medieval Europe, dried human poop is served as fuel and fertilizer."},
  {"id":8,"text":"Sharks have green poop due to bile pigments."},
  {"id":9,"text":"Platypus poop is pale and covered in shell fragments."},
  {"id":10,"text":"Some fungi grow only on herbivore poop—these are called coprophilous fungi."},
  {"id":11,"text":"Saltwater crocodiles eat their own poop to maintain gut bacteria."},
  {"id":12,"text":"Poop pills (fecal transplants) are now used to treat severe gut infections."},
  {"id":13,"text":"Baby sloths poop once a week in a ritual of descent and risk."},
  {"id":14,"text":"Scat detectors use animal poop DNA to track endangered species."},
  {"id":15,"text":"Rabbits and guinea pigs eat their own poop for nutrition (coprophagy)."},
  {"id":16,"text":"The word \"doodoo\" likely comes from this childish euphemism for poop."},
  {"id":17,"text":"Dolphins poop in communal pools to confuse predators."},
  {"id":18,"text":"In ancient Rome, human urine and poop were used for bleaching clothes."},
  {"id":19,"text":"Guano (bat poop) is rich fertilizer used worldwide."},
  {"id":20,"text":"The average person produces about 128 grams of poop daily."},
  {"id":21,"text":"Poop-based biogas is used to generate electricity in some villages."},
  {"id":22,"text":"Pink poop can appear after eating beets—or could be a sign of bleeding."},
  {"id":23,"text":"Camel poop is dry and used as an eco-friendly fuel in desert regions."},
  {"id":24,"text":"A healthy bathroom color: medium brown; any bile issue changes it."},
  {"id":25,"text":"Some snakes leave periscopic tail-end poop clouds when threatened."},
  {"id":26,"text":"Elephant poop is often sold as paper fiber in Thailand."},
  {"id":27,"text":"In Fiji, kids used to smear volcanic ash-based poop paste as paint."},
  {"id":28,"text":"Poop eating tiny flies (Fannia) love mammal droppings."},
  {"id":29,"text":"Jellyfish poop isn't very noticeable—it dissolves instantly."},
  {"id":30,"text":"Goat droppings are round pellets perfect for fire starting."},
  {"id":31,"text":"Poop color can reflect medication, supplements, or diet!"}, 
  {"id":32,"text":"In Japan, there's a poop museum—complete with golden turds."},
  {"id":33,"text":"Seagulls poop continuously mid-flight."},
  {"id":34,"text":"Some cultures believed unicorns’ poop to have healing properties."},
  {"id":35,"text":"Pig manure is used to produce biodiesel."},
  {"id":36,"text":"Fish poop recycles nutrients in aquaponic systems."},
  {"id":37,"text":"Poop floats when high in fat or gas (stool floats)."},
  {"id":38,"text":"Pandas poop up to 40 times daily due to poor digestion."},
  {"id":39,"text":"Poop emojis were first used in 2006 on Japanese cell phones."},
  {"id":40,"text":"Teenagers produce more poop per body mass than adults."},
  {"id":41,"text":"Vulture stomachs can kill pathogens; their poop is sterile."},
  {"id":42,"text":"In Korea, poop cafes are a real thing—yes, with poop-shaped desserts."},
  {"id":43,"text":"Sea cucumber poop increases ocean oxygen levels."},
  {"id":44,"text":"Cow poop patches in grass can affect grazing patterns."},
  {"id":45,"text":"A group of flamingos’ nests looks like pink poop hills."},
  {"id":46,"text":"Ferret poop is smelly and used in meat recovery training dogs."},
  {"id":47,"text":"Poop-based vaccines exist—for cattle against E. coli."},
  {"id":48,"text":"Wombat poop is cube-shaped to stay put on rocks."},
  {"id":49,"text":"Hippos are responsible for 20% of river poop in Africa."},
  {"id":50,"text":"The scent of poop can signal predator presence to other animals."}
]
